src/pages/guilda-ia/index.org
#+TITLE: Guilda de IA
#+SETUPFILE: ./setupfile.org
#+DESCRIPTION: Material didático do curso de Introdução à IA Generativa da Guilda de IA

* Sobre o curso

Material modular sobre construção de agentes de IA, da teoria à prática. 12 semanas de conteúdo para iniciantes.

** Pré-requisitos
- Lógica básica
- Curiosidade
- Conta Google (para Google Colab)
- API key de um provedor: [[https://aistudio.google.com/][Gemini]], [[https://huggingface.co/][HuggingFace]] ou [[https://openrouter.ai/][OpenRouter]]

** Tutor
Lucas S. Vieira (luksamuk)

* Cronograma

#+ATTR_HTML: :class guilda-table
| Semana | Data | Tema |
|--------+------+----------------------------------------------------|
| 00 | 10/04 | Abertura e alinhamento |
| 01 | 17/04 | O que é IA hoje? |
| 02 | 24/04 | Prompting básico |
| 03 | 08/05 | Python mínimo |
| 04 | 15/05 | Python + API de LLM |
| 05 | 22/05 | Estrutura de um agente |
| 06 | 29/05 | Primeira ferramenta |
| 07 | 05/06 | Ferramentas múltiplas |
| 08 | 12/06 | Embeddings e similaridade |
| 09 | 19/06 | RAG |
| 10 | 26/06 | Desenvolvimento livre |
| 11 | 03/07 | Apresentação final |

* Materiais por Semana

#+HTML: <table class="guilda-table">
#+HTML: <thead><tr><th>Semana</th><th>Tema</th><th>Apostila</th><th>Slides</th><th>Live</th><th>Mini aula</th></tr></thead>
#+HTML: <tbody>
#+HTML: <tr><td>00</td><td>Abertura e alinhamento</td><td>—</td><td><a href="/slides/00-abertura.html">Abrir slides</a></td><td>📺 <a href="https://www.youtube.com/watch?v=XvA9RAHBjBk">Ver no YouTube</a></td><td>🎬 <a href="https://youtu.be/Rt8tLgnZkrg">Ver no YouTube</a></td></tr>
#+HTML: <tr><td>01</td><td>O que é IA hoje?</td><td><a href="/pages/guilda-ia/01-nomenclaturas.html">Nomenclaturas de IA</a></td><td><a href="/slides/01-nomenclaturas.html">Abrir slides</a></td><td>Sem live</td><td>🎬 <a href="https://youtu.be/ay4EnE-xaf0">Ver no YouTube</a></td></tr>
#+HTML: <tr><td>02</td><td>Prompting básico</td><td><a href="/pages/guilda-ia/02-prompting.html">Prompting: Como falar com IA</a></td><td><a href="/slides/02-prompting.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr>
# Semana 03 - descomentar quando liberar
#+HTML: <!-- <tr><td>03</td><td>Python mínimo</td><td><a href="/pages/guilda-ia/03-python-minimo.html">Python mínimo: O essencial</a></td><td><a href="/slides/03-python-minimo.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->
# Semana 04 - descomentar quando liberar
#+HTML: <!-- <tr><td>04</td><td>Python + API de LLM</td><td><a href="/pages/guilda-ia/03-python-minimo.html">Python e APIs</a></td><td><a href="/slides/04-python-api.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->
# Semana 05 - descomentar quando liberar
#+HTML: <!-- <tr><td>05</td><td>Estrutura de um agente</td><td><a href="/pages/guilda-ia/05-estrutura-agente.html">Estrutura de Agente</a></td><td><a href="/slides/05-estrutura-agente.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->
# Semana 06 - descomentar quando liberar
#+HTML: <!-- <tr><td>06</td><td>Primeira ferramenta</td><td><a href="/pages/guilda-ia/06-primeira-ferramenta.html">Primeira Ferramenta</a></td><td><a href="/slides/06-primeira-ferramenta.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->
# Semana 07 - descomentar quando liberar
#+HTML: <!-- <tr><td>07</td><td>Ferramentas múltiplas</td><td><a href="/pages/guilda-ia/07-ferramentas-multiplas.html">Ferramentas Múltiplas</a></td><td><a href="/slides/07-ferramentas-multiplas.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->
# Semana 08 - descomentar quando liberar
#+HTML: <!-- <tr><td>08</td><td>Embeddings e similaridade</td><td><a href="/pages/guilda-ia/08-embeddings.html">Embeddings e Similaridade</a></td><td><a href="/slides/08-embeddings.html">Abrir slides</a></td><td>📺 Em breve</td><td>🎬 <a href="#">Em breve</a></td></tr> -->
# Semana 09 - descomentar quando liberar
#+HTML: <!-- <tr><td>09</td><td>RAG</td><td><a href="/pages/guilda-ia/09-rag.html">RAG: O agente que lê documentos</a></td><td><a href="/slides/09-rag.html">Abrir slides</a></td><td>📺 Em breve</td><td>🎬 <a href="#">Em breve</a></td></tr> -->
# Semana 10 - descomentar quando liberar
#+HTML: <!-- <tr><td>10</td><td>Desenvolvimento livre</td><td><a href="/pages/guilda-ia/10-desenvolvimento.html">Desenvolvimento e Ajustes</a></td><td><a href="/slides/10-desenvolvimento.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->
# Semana 11 - descomentar quando liberar
#+HTML: <!-- <tr><td>11</td><td>Apresentação final</td><td><a href="/pages/guilda-ia/11-apresentacoes.html">Apresentação Final</a></td><td><a href="/slides/11-apresentacoes.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->
#+HTML: </tbody>
#+HTML: </table>

# Nota: Mini aulas são vídeos educativos curtos (Manim + TTS) sobre conceitos específicos.
# Lives são as gravações das sessões ao vivo no YouTube.