pages/guilda-ia/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guilda de IA</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="description" content="Material didático do curso de IA Generativa da Guilda de IA
Material didático do curso de Introdução à IA Generativa da Guilda de IA" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="/css/main.css" />
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="/css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="/img/cat-i-mage.jpg" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="theme-color" content="#14171e">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<meta property="og:url" content="https://luksamuk.codes/pages/guilda-ia/index.html">
<meta property="og:type" content="website">
<meta property="og:title" content="Guilda de IA">
<meta property="og:description" content="Material didático do curso de IA Generativa da Guilda de IA
Material didático do curso de Introdução à IA Generativa da Guilda de IA">
<meta property="og:image" content="https://luksamuk.codes/img/banner-full.png">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:domain" content="luksamuk.codes">
<meta name="twitter:url" content="https://luksamuk.codes/pages/guilda-ia/index.html">
<meta name="twitter:title" content="Guilda de IA">
<meta name="twitter:description" content="Material didático do curso de IA Generativa da Guilda de IA
Material didático do curso de Introdução à IA Generativa da Guilda de IA">
<meta name="twitter:image" content="https://luksamuk.codes/img/banner.png">
</head>
<body>
<div id="preamble" class="status">
<div id="nav-wrapper"><nav id="site-nav"><a href="/"><i class="fa-solid fa-house"></i> Home</a> <a href="/pages/about.html"><i class="fa-solid fa-user"></i> About</a> <a href="/pages/games.html"><i class="fa-solid fa-gamepad"></i> Games</a> <a href="/pages/portfolio.html"><i class="fa-solid fa-briefcase"></i> Portfolio</a> <a href="/pages/learn.html"><i class="fa-solid fa-book-open"></i> Learn</a> <a href="/pages/talks-index.html"><i class="fa-solid fa-chalkboard-user"></i> Talks</a> <a href="/pages/blog.html"><i class="fa-solid fa-rss"></i> Blog</a> <button id="theme-selector" onclick="toggleTheme()"><i class="fa-solid fa-moon"></i></button></nav><h1 class="site-title"><a href="/">The Alchemist's Hideout</a></h1></div><h1 class="title">Guilda de IA</h1>
</div>
<div id="content" class="content">
<div id="outline-container-org596bd9f" class="outline-2">
<h2 id="org596bd9f">Sobre o curso</h2>
<div class="outline-text-2" id="text-org596bd9f">
<p>
Material modular sobre construção de agentes de IA, da teoria à prática. 12 semanas de conteúdo para iniciantes.
</p>
</div>
<div id="outline-container-org44e3972" class="outline-3">
<h3 id="org44e3972">Pré-requisitos</h3>
<div class="outline-text-3" id="text-org44e3972">
<ul class="org-ul">
<li>Lógica básica</li>
<li>Curiosidade</li>
<li>Conta Google (para Google Colab)</li>
<li>API key de um provedor: <a href="https://aistudio.google.com/">Gemini</a>, <a href="https://huggingface.co/">HuggingFace</a> ou <a href="https://openrouter.ai/">OpenRouter</a></li>
</ul>
</div>
</div>
<div id="outline-container-org46e459d" class="outline-3">
<h3 id="org46e459d">Tutor</h3>
<div class="outline-text-3" id="text-org46e459d">
<p>
Lucas S. Vieira (luksamuk)
</p>
</div>
</div>
</div>
<div id="outline-container-org4ccfa20" class="outline-2">
<h2 id="org4ccfa20">Cronograma</h2>
<div class="outline-text-2" id="text-org4ccfa20">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Semana</th>
<th scope="col" class="org-left">Data</th>
<th scope="col" class="org-left">Tema</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">00</td>
<td class="org-left">10/04</td>
<td class="org-left">Abertura e alinhamento</td>
</tr>

<tr>
<td class="org-right">01</td>
<td class="org-left">17/04</td>
<td class="org-left">O que é IA hoje?</td>
</tr>

<tr>
<td class="org-right">02</td>
<td class="org-left">24/04</td>
<td class="org-left">Prompting básico</td>
</tr>

<tr>
<td class="org-right">03</td>
<td class="org-left">08/05</td>
<td class="org-left">Python mínimo</td>
</tr>

<tr>
<td class="org-right">04</td>
<td class="org-left">15/05</td>
<td class="org-left">Python + API de LLM</td>
</tr>

<tr>
<td class="org-right">05</td>
<td class="org-left">22/05</td>
<td class="org-left">Estrutura de um agente</td>
</tr>

<tr>
<td class="org-right">06</td>
<td class="org-left">29/05</td>
<td class="org-left">Primeira ferramenta</td>
</tr>

<tr>
<td class="org-right">07</td>
<td class="org-left">05/06</td>
<td class="org-left">Ferramentas múltiplas</td>
</tr>

<tr>
<td class="org-right">08</td>
<td class="org-left">12/06</td>
<td class="org-left">Embeddings e similaridade</td>
</tr>

<tr>
<td class="org-right">09</td>
<td class="org-left">19/06</td>
<td class="org-left">RAG</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">26/06</td>
<td class="org-left">Desenvolvimento livre</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">03/07</td>
<td class="org-left">Apresentação final</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgbf3abe6" class="outline-2">
<h2 id="orgbf3abe6">Materiais por Semana</h2>
<div class="outline-text-2" id="text-orgbf3abe6">
<table>
<thead><tr><th>Semana</th><th>Tema</th><th>Apostila</th><th>Slides</th><th>Live</th><th>Mini aula</th></tr></thead>
<tbody>
<tr><td>00</td><td>Abertura e alinhamento</td><td>—</td><td><a href="/slides/00-abertura.html">Abrir slides</a></td><td>📺 <a href="https://www.youtube.com/watch?v=XvA9RAHBjBk">Ver no YouTube</a></td><td>🎬 <a href="https://youtu.be/Rt8tLgnZkrg">Ver no YouTube</a></td></tr>
<tr><td>01</td><td>O que é IA hoje?</td><td><a href="/pages/guilda-ia/01-nomenclaturas.html">Nomenclaturas de IA</a></td><td><a href="/slides/01-nomenclaturas.html">Abrir slides</a></td><td>Sem live</td><td>🎬 <a href="https://youtu.be/ay4EnE-xaf0">Ver no YouTube</a></td></tr>

<!-- <tr><td>02</td><td>Prompting básico</td><td><a href="/pages/guilda-ia/02-prompting.html">Prompting: Como falar com IA</a></td><td><a href="/slides/02-prompting.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->

<!-- <tr><td>03</td><td>Python mínimo</td><td><a href="/pages/guilda-ia/03-python-minimo.html">Python mínimo: O essencial</a></td><td><a href="/slides/03-python-minimo.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->

<!-- <tr><td>04</td><td>Python + API de LLM</td><td><a href="/pages/guilda-ia/03-python-minimo.html">Python e APIs</a></td><td><a href="/slides/04-python-api.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->

<!-- <tr><td>05</td><td>Estrutura de um agente</td><td><a href="/pages/guilda-ia/05-estrutura-agente.html">Estrutura de Agente</a></td><td><a href="/slides/05-estrutura-agente.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->

<!-- <tr><td>06</td><td>Primeira ferramenta</td><td><a href="/pages/guilda-ia/06-primeira-ferramenta.html">Primeira Ferramenta</a></td><td><a href="/slides/06-primeira-ferramenta.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->

<!-- <tr><td>07</td><td>Ferramentas múltiplas</td><td><a href="/pages/guilda-ia/07-ferramentas-multiplas.html">Ferramentas Múltiplas</a></td><td><a href="/slides/07-ferramentas-multiplas.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->

<!-- <tr><td>08</td><td>Embeddings e similaridade</td><td><a href="/pages/guilda-ia/08-embeddings.html">Embeddings e Similaridade</a></td><td><a href="/slides/08-embeddings.html">Abrir slides</a></td><td>📺 Em breve</td><td>🎬 <a href="#">Em breve</a></td></tr> -->

<!-- <tr><td>09</td><td>RAG</td><td><a href="/pages/guilda-ia/09-rag.html">RAG: O agente que lê documentos</a></td><td><a href="/slides/09-rag.html">Abrir slides</a></td><td>📺 Em breve</td><td>🎬 <a href="#">Em breve</a></td></tr> -->

<!-- <tr><td>10</td><td>Desenvolvimento livre</td><td><a href="/pages/guilda-ia/10-desenvolvimento.html">Desenvolvimento e Ajustes</a></td><td><a href="/slides/10-desenvolvimento.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->

<!-- <tr><td>11</td><td>Apresentação final</td><td><a href="/pages/guilda-ia/11-apresentacoes.html">Apresentação Final</a></td><td><a href="/slides/11-apresentacoes.html">Abrir slides</a></td><td>📺 Em breve</td><td>—</td></tr> -->
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
